Import Library

In [4]:
import pandas as pd

Create dataset

In [15]:
scores = pd.DataFrame({
    'name':['Rocky', 'Bobby', 'Maria', 'Raichel'],
    'age':[20, 25, 16, 19],
    'test1':[95, 80, 60, None],
    'test2':[65, 70, 98, 50],
    'teacher':['Denis', 'Denis', 'Windy', 'Windy']
})

Look at data

In [16]:
scores

      name  age  test1  test2 teacher
0    Rocky   20   95.0     65   Denis
1    Bobby   25   80.0     70   Denis
2    Maria   16   60.0     98   Windy
3  Raichel   19    NaN     50   Windy

MELTING

Melting data, allows us to stack columns on top of each other

In [43]:
melted = pd.melt(scores, id_vars=['name', 'age', 'teacher'], 
        value_vars=['test1', 'test2'],
        var_name='test', value_name='score')
melted

      name  age teacher   test  score
0    Rocky   20   Denis  test1   95.0
1    Bobby   25   Denis  test1   80.0
2    Maria   16   Windy  test1   60.0
3  Raichel   19   Windy  test1    NaN
4    Rocky   20   Denis  test2   65.0
5    Bobby   25   Denis  test2   70.0
6    Maria   16   Windy  test2   98.0
7  Raichel   19   Windy  test2   50.0

TRANSPOSING

Transposing meaning that we are swapping axis using pivot

In [45]:
melted.pivot_table(index=['name', 'age', 'teacher'],
                  columns='test', values='score').reset_index()

test     name  age teacher  test1  test2
0       Bobby   25   Denis   80.0   70.0
1       Maria   16   Windy   60.0   98.0
2     Raichel   19   Windy    NaN   50.0
3       Rocky   20   Denis   95.0   65.0

In [ ]:
STACKING

In [52]:
stack = scores.groupby(['teacher', 'age']).min()
stack

                name  test1  test2
teacher age
Denis   20     Rocky   95.0     65
        25     Bobby   80.0     70
Windy   16     Maria   60.0     98
        19   Raichel    NaN     50